haivivi/embed-zig/examples/esp/mic_test/zig/sdkconfig.defaults
# ESP32-S3-Korvo-2 V3 with PSRAM
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Compiler optimizations
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Stack size for main task (needs extra for I2S TDM + mic buffer)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# I2S configuration
CONFIG_I2S_SUPPRESS_DEPRECATE_WARN=y
